aedile/EmberTide/sdkconfig.defaults
# sdkconfig.defaults — FiestaQuest ESP-IDF SDK configuration defaults
#
# Target: ESP32-S3-PICO-1-N8R8
#   - Xtensa LX7 dual-core @ 240 MHz
#   - 8 MiB SPI Flash (QD)
#   - 8 MiB Octal PSRAM (SPIRAM)
#
# These settings are applied before sdkconfig. Any key not listed here
# uses the ESP-IDF component default.

# ---------------------------------------------------------------------------
# Partition table
# ---------------------------------------------------------------------------
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

# ---------------------------------------------------------------------------
# Flash size
# ---------------------------------------------------------------------------
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"

# ---------------------------------------------------------------------------
# SPIRAM (Octal PSRAM on ESP32-S3-PICO-1-N8R8)
# ---------------------------------------------------------------------------
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y

# SPIRAM allocation strategy: CAPS_ALLOC (allocation-aware).
#
# Previous: CONFIG_SPIRAM_USE_MALLOC=y (transparent — ALL malloc goes to PSRAM).
# This caused I2S DMA crashes because ESP-IDF's internal i2s_new_channel()
# calloc landed in PSRAM which isn't DMA-accessible on ESP32-S3.
#
# With CAPS_ALLOC: malloc()/calloc() use internal SRAM by default.
# PSRAM must be explicitly requested via heap_caps_malloc(MALLOC_CAP_SPIRAM).
# This is safer for DMA peripherals (SPI, I2S, USB) at the cost of requiring
# explicit SPIRAM allocation for large buffers (.mod files, etc).
#
# Changed during audio lab session 2026-04-05.
CONFIG_SPIRAM_USE_CAPS_ALLOC=y

# ---------------------------------------------------------------------------
# Target
# ---------------------------------------------------------------------------
CONFIG_IDF_TARGET="esp32s3"

# ---------------------------------------------------------------------------
# FreeRTOS
# ---------------------------------------------------------------------------
CONFIG_FREERTOS_HZ=1000

# ---------------------------------------------------------------------------
# Logging (default level: INFO; errors always logged)
# ---------------------------------------------------------------------------
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_BSP_AUDIO=y
